In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data.csv')
df.head()

    Nama  Umur Jenis_Kelamin  Pekerjaan
0   Andi    23          Pria  Mahasiswa
1   Budi    25          Pria  Mahasiswa
2  Citra    29        Wanita      Dosen
3   Dewi    24        Wanita   Karyawan
4    Eka    23          Pria  Mahasiswa

In [4]:
df = pd.get_dummies(df, columns=['Pekerjaan'])
df.head()

,Nama,Umur,Jenis_Kelamin,Pekerjaan_Dosen,Pekerjaan_Karyawan,Pekerjaan_Mahasiswa
0,Andi,23,Pria,False,False,True
1,Budi,25,Pria,False,False,True
2,Citra,29,Wanita,True,False,False
3,Dewi,24,Wanita,False,True,False
4,Eka,23,Pria,False,False,True

In [8]:
kolom_numerik = df['Umur']
mean = kolom_numerik.mean()
median = kolom_numerik.median()
modus = kolom_numerik.mode()[0]
print(f"Mean: {mean}\nMedian: {median}\nModus: {modus}")

Mean: 24.25
Median: 23.5
Modus: 23

In [9]:
range_value = kolom_numerik.max() - kolom_numerik.min()
variance = kolom_numerik.var()
std_dev = kolom_numerik.std()
print(f"Range: {range_value}, \nVariance: {variance}, \nStandar Deviasi: {std_dev}")

Range: 9,
Variance: 7.4772727272727275,
Standar Deviasi: 2.7344602259445514